0ld/publish/programacion/google-translate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2021-08-23 lun 00:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Plugin de Google translate</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="../style.css" />
<link rel="shortcut icon" type="image/jpg" href="../favicon.png"/>
<meta name="theme-color" content="#fff">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no"/>
<div id="google_translate_element"></div></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Plugin de Google translate
<br />
<span class="subtitle">Programación</span>
</h1>

<div id="outline-container-org48518db" class="outline-2">
<h2 id="org48518db">Añadir el plugin traduccion</h2>
<div class="outline-text-2" id="text-org48518db">
<p>
Añadir el plugin es muy sencillo de installar, simplemente tenmos que añadir el siguiente código en nuestra pagina.
NOTA: tenemos que añadir este script en <b>todas las paginas en las que queramos traducir</b>.
</p>

<pre class="example">

&lt;div id="google_translate_element"&gt;&lt;/div&gt;
&lt;script defer&gt; 
function googleTranslateElementInit() {

new google.translate.TranslateElement({

pageLanguage: 'es' // &lt;- idioma default, aquí esta en español

}, 'google_translate_element');

}
&lt;/script&gt;

&lt;script defer src="//translate.google.com/translate_a/element.js?cb=googleTranslateElementInit"&gt;
&lt;/script&gt;

</pre>
</div>
</div>



<div id="outline-container-org3931817" class="outline-2">
<h2 id="org3931817">Ajustes personales</h2>
<div class="outline-text-2" id="text-org3931817">
</div>
<div id="outline-container-orgcb9bdba" class="outline-3">
<h3 id="orgcb9bdba">añadir "defer" en el tag script</h3>
<div class="outline-text-3" id="text-orgcb9bdba">
<p>
Esto para hacer la carga del plugin sea asincrona y poder cargar nuestros propios scripts sin preocuparnos de que el plugin haya terminado de cargar.
</p>
</div>
</div>

<div id="outline-container-org02164cb" class="outline-3">
<h3 id="org02164cb">ocultar la lista de idiomas</h3>
<div class="outline-text-3" id="text-org02164cb">
<p>
Para traducir todas las paginas de nuestro sitio tenemos que agregar este script en todas las paginas, podemos integrar este componente con nuestro diseño ó podemos ocultarlo con css:
</p>

<pre class="example">

#google_translate_element{
    display:none;
}

</pre>
</div>
</div>
</div>
</div>
</body>
</html>
